Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Ratnaketu Dhāraṇī from the Great Collection

source: དེ་བཞིན་གཤེགས་པ་འོད་ཞི་སྤོས་སྣང་དཔལ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the thus-gone Splendorous with the Gentle Glow of Light and Fragrance!

source: །ཚངས་པ་ཆེན་པོ་དབྱངས་ཅན་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the one with the melodious voice of Mahābrahmā!

source: །དེ་ལ་ཕྱག་འཚལ་ཏེ། བདུད་ཀྱི་འཁོར་གྱིས་མི་ཚུགས་པ་ཞེས་བྱ་བའི་གཟུངས་འདི་སྦྱོར་བར་བགྱིས།
en: Having paid homage to him, one should employ the dhāraṇī called unharmed by the assemblies of Māra

source: བདག་གིས་རིག་སྔགས་འདི་གྲུབ་པར་གྱུར་ཅིག་འདི་ལྟ་སྟེ།
en: May I accomplish the following mantra:

source: ཨ་བཱ་མེ། ཨ་བཱ་མེ། ཨཾ་བ་རེ། ཨཾ་བ་རེ། པ་རི་ཀུན་ཛ། ན་ཊ་ན་ཊ། པུ་སྐ་ར་བཱ་ཧ། ཛ་ལུ་ཁ། ཁ་མ་ཁ་ཡ། ཨི་ལི་མི་ལི། ཀི་ལི་མི་ལི། ཀཱིརྟི་པ་ར། མུ་དྲེ་མུ་དྲ་མུ་ཁེ་སྭཱ་ཧཱ།
en: Avāme avāme amvare amvare parikuñja naṭa naṭa puṣkaravaha jalukha khama khaya ili mili kili mili kīrtipara mudre mudramukhe svāhā!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་འོད་མའི་ཚལ། བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན། དགེ་སློང་སྟོང་དུ་ཚང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: The Blessed One was dwelling in Veṇuvana, at the Kalandakanivāpa, near the city of Rājagṛha, with a great saṅgha of a thousand monks, all of whom were noble ones.

source: ཁུར་བོར་བ། བདག་གི་དོན་རབ་ཏུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཆད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: They had all exhausted defilements, were free from the afflictions, were powerful, had liberated minds, had liberated insight, were of noble birth, were great elephants, had done what needed to be done, had completed their mission, had cast off the burden, had achieved their own welfare, had severed the bonds that tied them to existence, had liberated their minds with genuine knowledge, and had perfected all mental powers.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཁྲིའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་ལ་འདི་ལྟ་སྟེ། ལྷུན་པོའི་རྩེ་འཛིན་གཞོན་ནུར་གྱུར་པ་དང་། ཆུ་ལྷའི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། བཟང་པོའི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། རྒྱལ་བའི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། འོད་ཀྱི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། ནམ་མཁའི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། གློག་གི་བློ་གྲོས་གཞོན་ནུར་གྱུར་པ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། ཐུབ་དཀའ་གཞོན་ནུར་གྱུར་པ་དང་། ཆུ་ལྷ་གཞོན་ནུར་གྱུར་པ་དང་། དྲི་མེད་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་ཐམས་ཅད་ཀྱང་།
en: There was also a great saṅgha of ten thousand bodhisattvas, including the princely youth Holder of Meru’s Peak, the princely youth Varuṇamati, the princely youth Sumati, the princely youth Jayamati, the princely youth Jinamati, the princely youth Intelligent Light, the princely youth Intelligent Sky, the princely youth Intelligent Lightning, the princely youth Mañjuśrī, the princely youth Durdharṣa, the princely youth Varuṇa, the princely youth Vimala, the bodhisattva great being Maitreya, and others.

source: བཟོད་པ་དང་། གཟུངས་དང་། ཏིང་ངེ་འཛིན་ཐོབ་པ། ཆོས་ཐམས་ཅད་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་ཅན། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ། བདུད་ཀྱི་ཡུལ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པ།
en: Each of these ten thousand bodhisattvas had achieved acceptance, retention, and absorption. Each possessed the wisdom that is unobscured by any phenomenon, had equal concern for all beings, had transcended all the domains of Māra, and had entered the domain of all the thus-gone ones.

source: ཤེས་པ་ལ་མཁས་པ། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཐབས་ཤེས་པ་ལ་མཁས་པ།
en: Each was knowledgeable, possessed great love and compassion, and was skilled in means.

source: ཤ་སྟག་དང་ཡང་ཐབས་ཅིག་གོ། །དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་ཀུན་ཏུ་རྒྱུ་མཁས་པ་གསལ་བ། ཡིད་གཞུངས་པ། རིག་པའི་གནས་བཅྭ་བརྒྱད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། གཡོག་ལྔ་བརྒྱ་པ།
en: At the same time, there were two wandering mendicants in the city of Rājagṛha who were learned, lucid, and intelligent, had perfected the eighteen branches of knowledge, and had five hundred servants.

source: གཅིག་གི་མིང་ནི་ཉེ་རྒྱལ། གཅིག་གི་མིང་ནི་པང་ནས་སྐྱེས་ཞེས་བྱ་བ་གཉིས་ཤིག་འཁོད་དོ།
en: One was named Upatiṣya and the other Kaulita.

source: །ཚོགས་ཀྱི་གཙོ་བོ་གཡོག་གི་ཚོགས་ཅན་དེ་གཉིས་ཕན་ཚུན་འདི་ལྟར་བདག་ཅག་ལས་གང་གིས་ཐོག་མར་བདུད་རྩི་ཐོབ་པ་དེས་གཅིག་ལ་གཅིག་སྦྲན་ཏོ།
en: These two were heads of their retinues and leaders of pupils. They made each other the promise that “whoever first attains the nectar shall let the other know.”

source: །ཞེས་དམ་ཚིག་བྱས་སོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ། ཤམ་ཐབས་དང་ཆོས་གོས་བགོས།
en: Early the next morning, Venerable Aśvajit donned his lower and upper Dharma robes.

source: ལྷུང་བཟེད་ཐོགས་ནས། རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་པ་དང་། ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་སྤྱོད་ཡུལ་དུ་ཞུགས་ནས།
en: Carrying his alms bowl, he went to the city of Rājagṛha to collect alms.

source: རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་སོང་བ་མཐོང་ངོ་། །མཐོང་ནས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The wandering mendicant Upatiṣya happened to come across Venerable Aśvajit and saw that he had entered the city of Rājagṛha to collect alms.

source: ཅི་ལྟར་དགེ་སྦྱོང་འདིའི་སྤྱོད་ལམ་མཛེས་པ་དེ་ལྟ་བུ་ནི་བདག་གི་སྔོན་ཅད་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ་མིར་གྱུར་པ་གཞན་སུ་ལ་ཡང་གང་ལ་ཡང་སྔོན་མ་མཐོང་ན།
en: He thought, “How is it that I have never before seen such beautiful deportment in any other mendicant, brahmin, or person as in this mendicant?

source: བདག་དེའི་གན་དུ་སོང་སྟེ། ཚེ་དང་ལྡན་པ་ཁྱོད་ཀྱི་སྟོན་པ་གང་ཡིན།
en: I shall go before him and ask, ‘Venerable One, who is your teacher?

source: གང་ལས་རབ་ཏུ་བྱུང་།
en: With whom did you go forth?

source: གང་གིས་ཆོས་ལ་དགའ་ཞེས་འདྲིའོ་སྙམ་ནས།
en: Whose doctrine are you devoted to?’”

source: ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་ལྷན་ཅིག་མངོན་དུ་ཡང་དག་པར་དགའ་བར་བྱ་བ་དང་། ཡང་དག་པར་མགུ་བར་བྱ་བའི་གཏམ་སྣ་ཚོགས་བྱས་ཏེ།
en: So the wandering mendicant Upatiṣya went to where Venerable Aśvajit was and engaged in a good deal of friendly conversation.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས།
en: They then sat down to one side.

source: ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཁྱོད་ཀྱི་སྟོན་པ་གང་།
en: Sitting there, the wandering mendicant Upatiṣya asked Venerable Aśvajit, “Venerable One, who is your teacher?

source: གང་གི་ཆོས་ལ་དགའ།
en: Whose doctrine are you devoted to?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱིས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then Venerable Aśvajit answered the wandering mendicant Upatiṣya:

source: །ཤཱཀྱའི་སྲས་པོ་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཆེན་པོ་ཀུན་གྱི་དམ་པ་དབང་དང་ལྡན།
en: “The son of the Śākyas has mastery over all disciplines and great austerities.

source: །འཁོར་བའི་རྒྱ་མཚོའི་ཕ་རོལ་ཕྱིན་ཅིང་གྲོལ་ལ་དེ་བཞིན་འགྲོ་བ་སྒྲོལ་མཛད་པ།
en: Having crossed the ocean of saṃsāra he is now free, and so liberates others.

source: །སངས་རྒྱས་ཞེས་བྱ་སད་མཛད་མི་མཉམ་སྡུག་བསྔལ་མཚོ་སྐེམས་ད་ལྟར་འདི་ན་ཡོད།
en: Known as ‘Buddha,’ being unequaled in his capacity to awaken, he dries up the ocean of suffering, and now exists here in this world.

source: །དྲི་མ་མེད་པ་དེ་ཡི་སྐྱབས་སུ་ང་སོང་ང་ནི་དེ་ཡི་ཆོས་ལ་དགའ། །ཉེ་རྒྱལ་གྱིས་སྨྲས་པ།
en: I have taken refuge in this Immaculate One and am devoted to his Dharma.”

source: ཁྱོད་ཀྱི་སྟོན་པ་ཇི་སྐད་སྨྲ།
en: “What does your teacher preach?

source: ཇི་སྐད་སྟོན།
en: What does he teach?” asked Upatiṣya.

source: ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱིས་སྨྲས་པ།
en: Venerable Aśvajit responded, “I will answer you.

source: དེའི་ཕྱིར་ཚེ་དང་ལྡན་པ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ།
en: Venerable, listen well and bear what I say in mind. I will answer you.

source: །ཇི་ལྟར་འཇིག་རྟེན་ལས་དང་ཉོན་མོངས་རྒྱུར་བཅས་བྱེད་རྒྱུར་ལྡན་འབྱུང་དང་། །ལས་དང་ཉོན་མོངས་པ་དག་ལྡོག་རྒྱུ་དེ་ཡང་འདྲེན་པས་རབ་ཏུ་གསུངས།
en: “The Guide professed how the world arises caused by action and afflictions, And he also professed the remedies for reversing such action and afflictions. This Lord of Orators taught from his own knowledge the supreme liberation,

source: །གང་ན་སྐྱེ་དང་རྒ་དང་རྒུད་པའི་སྡུག་བསྔལ་ངེས་པར་མི་གནས་པ། །ཐར་པའི་མཆོག་དེ་སྨྲ་བའི་ཁྱུ་མཆོག་དེ་ཡིས་རང་གིས་མཁྱེན་ཏེ་གསུངས།
en: Where the sufferings of birth, aging, and decline are definitely not present.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་།
en: When the wandering mendicant Upatiṣya heard this teaching, he purified the stainless and immaculate Dharma eye that sees phenomena.

source: དྲི་མ་དང་བྲལ་ལ་ཉོན་མོངས་པ་མེད་པ་སྐྱེས་ཏེ།
en: A state free from the afflictions arose, and he attained the fruit of stream entry.

source: དེས་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He then said:

source: །སངས་རྒྱས་ཀྱིས་ནི་ཤིན་ཏུ་རྙེད་དཀའ་ཐོས་གཏེར་བདུད་རྩིའི་ཆོས་བཤད་པ།
en: “The Buddha teaches the ambrosial Dharma, a treasure to hear, that is so difficult to find.

source: །འདི་ནི་རྟག་ཏུ་སྐྱེ་བའི་འབབ་ཆུ་སྐེམས་པར་བདེན་པར་ཁོང་དུ་ཆུད།
en: It penetrates the truth, drying up the perpetual torrent of rebirth.

source: །དེ་ནི་འགྲོ་བ་རྣམས་ཀྱི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་འགྱུར་བ་སྟེ།
en: It quells the suffering of all beings.

source: །ལམ་འདི་དམ་པ་ཤེས་རབ་ཆོས་རྣམས་བསྒོམ་པ་མི་མཉམ་བྱེད་པ་ཡིན།
en: This sublime path consists in the peerless cultivation of qualities of insight.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ད་ལྟ་ག་ལ་བཞུགས།
en: The wandering mendicant Upatiṣya then asked Venerable Aśvajit, “Venerable, where is the thus-gone, worthy, perfect Buddha right now?”

source: ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་བཅོམ་ལྡན་འདས་ནི་རྒྱལ་པོའི་ཁབ་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན་འདི་ལྟ་སྟེ།
en: Venerable Aśvajit answered, “Venerable, the Blessed One is now staying in Veṇuvana, at the Kalandakanivāpa, near Rājagṛha.

source: རལ་པ་ཅན་སྟོང་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །ཉེ་རྒྱལ་གྱིས་སྨྲས་པ།
en: He is residing there with the great monastic saṅgha of one thousand monks who have gone forth and who used to have matted hair.”

source: བདག་གི་གྲོགས་པོའི་མཆོག་དང་། སློབ་མའི་འཁོར་ལ་བལྟས་ཏེ།
en: Upatiṣya said, “Once I have seen my best friend and disciples, I will vow to go forth before the Blessed One.”

source: བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་རབ་ཏུ་འབྱུང་ངོ་། །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: The wandering mendicant Upatiṣya then bowed his head to the feet of Venerable Aśvajit and circumambulated him three times.

source: སླར་སོང་ནས་ཀུན་ཏུ་རྒྱུ་པང་ནས་སྐྱེས་ག་ལ་བ་དེར་སོང་བ་དང་། ཀུན་ཏུ་རྒྱུ་པང་ནས་སྐྱེས་ཀྱིས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་རྒྱང་རིང་པོ་ནས་འོང་བ་མཐོང་སྟེ།
en: He once again departed and went to meet the wandering mendicant Kaulita.

source: མཐོང་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཁྱོད་ཀྱི་དབང་པོ་རྣམས་ནི་དངས། བཞིན་གྱི་མདངས་ནི་ཡོངས་སུ་དག །པགས་པའི་མདོག་ནི་ཀུན་ཏུ་དཀར་བ་ལས་ན། ཚེ་དང་ལྡན་པ་ཁྱོད་ཀྱིས་བདུད་རྩི་རྙེད་དོ། །ཉེ་རྒྱལ་གྱིས་སྨྲས་པ།
en: The wandering mendicant Kaulita saw the wandering mendicant Upatiṣya coming from far off and exclaimed, “Venerable, given that your faculties look so clear, that your facial complexion looks so pure, and that the tone of your skin looks so light—Venerable, you must have found the nectar!”

source: ཚེ་དང་ལྡན་པ་དེ་དེ་བཞིན་ཏེ།
en: “So it is, Venerable One!” Upatiṣya responded.

source: ཁོ་བོས་བདུད་རྩི་རྙེད་ཀྱིས་ཚེ་དང་ལྡན་པ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ཁོ་བོས་ཅི་སྙེད་པ་ཁྱོད་ལ་བཤད་དོ།
en: “I have found the nectar! Therefore, Venerable, listen well and bear what I say in mind. I will tell you of what I have found.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་པང་ནས་སྐྱེས་སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The wandering mendicant Kaulita then rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: With palms together he bowed toward Upatiṣya and said: “Tell me of the path to peace and the end of anguish,

source: །གང་གིས་སྲིད་གསུམ་རྒྱ་མཚོ་མྱུར་རྒལ་ཞིང་།
en: Which swiftly takes one across the ocean of the three realms of existence

source: །ཕུང་པོ་དགྲ་ཆེན་རྣམ་པར་གཞིག་བྱ་བ།
en: While destroying the great enemy of the aggregates.

source: །མྱ་ངན་མེད་ཞི་ལམ་དེ་ཤོད་ཅིག་དང་། །ཡང་འབྱུང་མེད་པའི་ལམ་དུ་འཇུག་པར་བྱ།
en: I will then set forth on the path that eliminates further origination.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The wandering mendicant Upatiṣya then said:

source: །ཇི་ལྟར་འཇིག་རྟེན་ལས་དང་ཉོན་མོངས་རྒྱུར་བཅས་བྱེད་རྒྱུ་ལྡན་འབྱུང་དང་། །ལས་དང་ཉོན་མོངས་པ་དག་ལྡོག་རྒྱུ་དེ་ཡང་འདྲེན་པས་རབ་ཏུ་གསུངས།
en: “The Guide professed how the world arises caused by action and afflictions, And he also professed the remedies for reversing such action and afflictions.

source: །གང་ན་སྐྱེ་དང་རྒ་དང་རྒུད་པའི་སྡུག་བསྔལ་ངེས་པར་མི་གནས་པ། །ཐར་པ་མཆོག་དེ་སྨྲ་བའི་ཁྱུ་མཆོག་དེ་ཡིས་རང་གིས་མཁྱེན་ཏེ་གསུངས།
en: This Lord of Orators taught from his own knowledge the supreme liberation wherein sufferings of birth, aging, and decline are definitely not present.”

source: །པང་ནས་སྐྱེས་ཀྱིས་སྨྲས་པ།
en: Kaulita responded:

source: སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱ་ཕྱིར་དྲི་མ་མེད་པ་ཞི་བའི་ཆོས།
en: “That sage teaches the immaculate and peaceful Dharma that serves to quell all suffering.

source: །ཉོན་མོངས་ལྟ་ངན་ཉེས་པ་ཐམས་ཅད་ཞི་བྱེད་མི་ཤེས་གཅོད་པ་དང་། །འདི་ནི་འདུས་བྱས་གསོག་གསོབ་དེ་ཕྱིར་སྟོང་པ་སླུ་བར་ཐུབ་པས་གསུངས།
en: It quells all afflictions, negative views, and faults, and it cuts through unknowing. He teaches that conditioned things are false and thus empty and deceptive.

source: །དེ་ཐོས་ཞི་བ་རེག་འགྱུར་དྲི་མ་མེད་པའི་ཚིག་དེ་ཟློས་ཏེ་གསུངས།
en: Hearing this brings one to peace, so please repeat these immaculate words that he spoke.”

source: །ཉེ་རྒྱལ་གྱིས་སྨྲས་པ།
en: Upatiṣya said:

source: ཇི་ལྟར་འཇིག་རྟེན་ལས་དང་ཉོན་མོངས་རྒྱུར་བཅས་བྱེད་རྒྱུར་ལྡན་འབྱུང་དང་། །ལས་དང་ཉོན་མོངས་པ་དག་ལྡོག་རྒྱུ་དེ་ཡང་འདྲེན་པས་རབ་ཏུ་གསུངས།
en: “The Guide professed how the world arises caused by action and afflictions, And he also professed the remedies for reversing such action and afflictions. This Lord of Orators taught from his own knowledge the supreme liberation

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་པང་ནས་སྐྱེས་ཀྱིས་དེ་ཉིད་དུ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་ལ།
en: The wandering mendicant Kaulita then purified the stainless and immaculate Dharma eye that sees phenomena.

source: ཉོན་མོངས་པ་མེད་པ་རྣམ་པར་སྦྱངས་ཏེ། དེས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: As he was thus purified and his afflictions were eliminated, he attained the fruit of stream entry. Then he proclaimed:

source: །ཡང་དག་སྤྱོད་པ་འདི་ནི་ཆུ་བོ་སྒྲོལ་བ་ཞི་བ་མགྱོགས་པའི་གཟིངས།
en: “This genuine conduct is a boat that liberates from, quells, and swiftly crosses the river.

source: །ཡེ་ཤེས་མཆོག་འདི་སྡུག་བསྔལ་གསུམ་པོ་ཞི་བྱེད་འཁོར་བའི་ཕ་རོལ་འགྲོ།
en: This supreme wisdom pacifies the three types of suffering and crosses over saṃsāra.

source: །འདི་ནི་ཡོངས་སུ་ཤེས་ན་ཉོན་མོངས་ཕུང་པོ་འཇོམས་ཤིང་བདུད་འདུལ་འགྱུར།
en: If one realizes this, one will defeat the afflictions and aggregates and tame the māras.

source: །ཐར་པ་འདི་ནི་དགྲ་དང་ཐབ་མོ་བསལ་ཅིང་སྡུག་བསྔལ་རྒྱ་མཚོ་སྐེམས། །པང་ནས་སྐྱེས་ཀྱིས་སྨྲས་པ།
en: This emancipation clears away enemies and struggles and dries up the ocean of suffering.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ད་ལྟ་ག་ལ་བཞུགས།
en: Kaulita asked, “Where is the thus-gone, worthy, perfect Buddha right now?”

source: ཉེ་རྒྱལ་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་བདག་གིས་བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་འོད་མའི་ཚལ་བྱ་ཀ་ལན་ད་ཀ་གནས་པ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཞེས་ཐོས་ན། བདག་ཅག་གཉིས་བཅོམ་ལྡན་འདས་དེའི་ཐད་དུ་རབ་ཏུ་འབྱུང་ངམ། པང་ནས་སྐྱེས་ཀྱིས་སྨྲས་པ།
en: “Venerable,” Upatiṣya answered, “I have heard that the Blessed One is now staying in Veṇuvana, at the Kalandakanivāpa, near Rājagṛha, with a great saṅgha of monks and a great saṅgha of bodhisattvas. What if we go forth in the presence of the Blessed One?”

source: བདག་ཅག་གི་འཁོར་ལ་བལྟས་ཏེ་རབ་ཏུ་འབྱུང་ངོ་།
en: With our followers in mind, let us go forth.”

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་རང་གི་འཁོར་ག་ལ་བ་དེར་དོང་ངོ་།
en: The wandering mendicants Upatiṣya and Kaulita then went to their followers.

source: །དེ་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་བདུད་སྡིག་ཅན་གྱིས་ཡུལ་ཨང་ག་མ་ག་དྷཱ་ན་མཁས་ཤིང་སྙན་པ་དང་། བརྗོད་པ་དང་གྲགས་པར་ལྡན་པ་སྐྱེས་བུ་དམ་པ་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་གཡོག་དང་བཅས་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་འདོང་ངོ་ཞེས་ཐོས་ནས།
en: Just then in the land of Aṅga-Magadha, Māra the evil one heard that the learned, well-spoken, eloquent, and renowned good men Upatiṣya and Kaulita, along with their followers, were on their way to take ordination under the teachings of the monk Gautama.

source: དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: He thought, “Alas!

source: །ཀྱི་ཧུད་དེ་གཉིས་གལ་ཏེ་དགེ་སྦྱོང་གཽ་ཏ་མའི་སློབ་མར་གྱུར་ན་བདག་གི་བདུད་ཀྱི་ཡུལ་སྟོངས་པར་བྱེད་པར་འགྱུར་གྱིས།
en: If those two become students of the monk Gautama, they will empty my māra realm.

source: བདག་དེར་སོང་སྟེ་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་རབ་ཏུ་འབྱུང་བ་ལས་བཟློག་ལ། སྡིག་པ་ཅན་གྱི་ལྟ་བ་འཛིན་དུ་འཇུག་གོ། །སྙམ་སྟེ།
en: So I must go there and dissuade those two good men from going forth. I must make them embrace the view of the evil one.”

source: དེ་ནས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་བདུད་སྡིག་ཅན་མྱུར་དུ་བདག་གི་ཁང་པ་ནས་མི་སྣང་བར་བྱས་ཏེ། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་གྱི་ཆ་བྱད་དང་རྟགས་དང་སྤྱོད་ལམ་དུ་བསྒྱུར་ནས།
en: At the same moment, Māra , the evil one, disappeared from his abode and took on the apparel, attributes, and behavior of Venerable Aśvajit.

source: སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱི་མདུན་ན་ལམ་ཀར་འདུག་སྟེ། འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He stood in the road before the two good men, and declared:

source: །ཁོ་བོས་སྔར་སྨྲས་རྒྱུ་དང་བྱེད་རྒྱུ་ལྟ་བུ་དེ་ནི་ལོག་པ་སྟེ།
en: “What I said before about causation, using cause similes, is wrong.

source: ཁྱེད་གཉིས་ཡིད་ཀྱི་སྤྱོད་པ་ཅི་ལ་ངེས་པ་བགམ་པར་བྱ་བའི་ཕྱིར།
en: I said it in order to definitively test your way of thinking.

source: །སྨྲས་པ་དེ་དག་ཐམས་ཅད་དོན་ཡོད་མ་ཡིན་འདི་ལ་རྒྱུ་ཡང་མེད།
en: All that I said before is nonsense, as there are no karmic causes.

source: །དགེ་དང་མི་དགེའི་ལས་དེའི་འབྲས་བུ་ཐོབ་པ་འདི་ན་ག་ལ་ཡོད།
en: How could bad or good actions possibly produce results?

source: །མྱུར་དུ་ཁྱེད་གཉིས་འདོད་པའི་ཡོན་ཏན་རྣམས་ལ་རབ་སྤྱོད་རྩེད་མོ་བྱོས།
en: “You should promptly pursue sensual delights and seek amusements.

source: །སྐྱེ་རྒ་ན་འཆི་མེད་ཅིང་སྡུག་བསྔལ་མེད་དེ་འཇིག་རྟེན་ཕ་རོལ་མེད།
en: There is no death, nor is there birth, suffering, aging, or the hereafter,

source: །བསོད་ནམས་བསོད་ནམས་མ་ཡིན་ལས་བསྐྱེད་འབྲས་མེད་རྒྱུ་དང་བྱེད་པ་མེད།
en: And there are no good or bad results generated by action, given that there are no causes or actions.

source: །རྙེད་ཕྱིར་འདིར་ནི་ཤཱཀྱའི་བུ་ཡིས་སྨྲས་ཀྱིས་དད་པས་མ་འགྲོ་ཤིག །དེ་ནས་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་གཉི་ག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: The scion of the Śākyas teaches this for his own gain, so do not put your faith in him.”

source: ཀྱེ་མ་བདུད་སྡིག་ཅན་བདག་ཅག་རབ་ཏུ་བྱུང་བ་ལས་བཟློག་པའི་ཕྱིར་འོངས་སོ་སྙམ་ནས།
en: Upatiṣya and Kaulita then thought, “It must be Māra , the evil one, who has approached us in order to dissuade us from entering the religious life.”

source: དེ་ནས་ཉེ་རྒྱལ་རྒྱབ་ཀྱིས་ཕྱོགས་ཏེ་འདུག་ནས་རང་གི་འཁོར་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Upatiṣya turned around and addressed his followers.

source: །བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ཉོན་ཅིག་འཁོར་བའི་སྐྱོན།
en: “Listen, my pupils, and remember the shortcomings of saṃsāra:

source: །དྲན་པར་གྱིས་ལ་འཇིག་རྟེན་རྒ་བ་ཡིས། །གཟིར་ཞིང་འཆི་བདག་གིས་ནི་རབ་བསྐོར་བ།
en: “The world is afflicted by old age and surrounded by death.

source: །དེ་གཉིས་སྤང་ཕྱིར་རབ་བྱུང་ལེགས་པར་ཟུང་།
en: To eliminate them both, you must fully embrace the wandering mendicant’s life.”

source: །དེ་ནས་པང་ནས་སྐྱེས་ཀྱིས་བདུད་ལ་སླར་སྨྲས་པ།
en: Kaulita, for his part, spoke to Māra

source: མཁས་པའི་བློ་འཆང་སྡུག་བསྔལ་གསུམ་མཐར་ཕྱིན་མཆོག་ཆོས་རྣམས་ཀུན་ཤེས་ཀྱིས།
en: “Known as the best, the Dharma captivates the minds of the wise and ends the three sufferings.

source: །རྣམ་པ་ཀུན་ཏུ་བདག་ཅག་བློ་གྲོས་འདི་ལས་བསྐྱོད་ནུས་སུ་ཡང་མེད།
en: There is no one anywhere who could shake us from this knowledge.

source: །སྲེད་པ་རབ་ཞི་བྱ་ཕྱིར་བདག་ཅག་བརྟན་པའི་ཡིད་ཀྱིས་རྟག་ཏུ་འབད།
en: We constantly exert ourselves with the resolute intention to quell our craving.

source: །སེང་གེའི་གཟུགས་ཅན་ཝ་ཡི་ཚིག་གིས་ངེད་ཀྱི་བློ་གྲོས་མ་བསྒྱུར་ཅིག །བདེན་པ་མཐོང་བའི་ལྷ་གང་དག་ནམ་མཁའ་ལ་འདུག་པ་དེ་དག་གིས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: How could the words of a jackal in a lion’s guise sway our minds?” Those gods who were able to behold truth hovered in the sky and applauded these two good men:

source: སྐྱེས་བུ་དམ་པ་ཁྱེད་གཉིས་ལེགས་སོ་ལེགས་སོ། །འདི་ལྟ་སྟེ།
en: “Good, good it is, O good men!

source: རབ་ཏུ་འབྱུང་བ་དང་། མངོན་པར་འབྱུང་བ་འདི་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ལམ་ཡིན་ཏེ།
en: This path whereby one leaves home to embrace the life of a wandering mendicant is eminent throughout the entire world.

source: ལམ་འདི་ནི་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བའོ།
en: It quells all suffering.

source: །ལམ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལ་འཇུག་པའོ། །འདི་ལྟ་སྟེ། རབ་ཏུ་འབྱུང་བ་དང་། མངོན་པར་འབྱུང་བ་འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ཀྱི་རབ་ཏུ་བསྔགས་ཤིང་བསྟོད་པའི་ལམ་མོ།
en: It is the path leading into the domain of all the thus-gone ones. It has been explained and praised by all the blessed buddhas as the path that leads from home to the life of a wandering mendicant.”

source: །དེ་ནས་ཡང་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་སྟེ་ཡིད་ལ་གཅགས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་སོང་ངོ་།
en: Māra , the evil one, unhappy, dejected, and sullen, disappeared then from that very spot.

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་གཉིས་ཀྱིས་རང་གི་འཁོར་ལ་བལྟས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བྲམ་ཟེའི་ཁྱེའུ་དག་ངེད་ནི་རྒ་བ་དང་ན་བ་དང་། འཆི་བའི་རྒྱ་མཚོའི་ཕ་རོལ་ཏུ་འགྲོ་བར་བྱ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་རབ་ཏུ་འབྱུང་བར་ཡང་དག་པར་ཆས་ཀྱིས།
en: The two wandering mendicants, Upatiṣya and Kaulita, directed their gaze at their followers and said, “You ought to know, pupils, that owing to the Thus-Gone One the two of us are setting forth into the wandering mendicant’s life in order to reach the far shore of the ocean of aging, sickness, and death.

source: ཁྱེད་ཀྱིས་ཤེས་པར་གྱིས་ཤིག །ཁྱེད་རྣམས་ལས་གང་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་མི་འདོད་པ་དེ་ནི་འདི་ནས་ཕྱིར་ལོག་ཤིག །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །བདག་ཅག་ཅུང་ཟད་ཤེས་པ་དེ་ཀུན་ཀྱང་ཁྱེད་ཀྱི་མཐུ་ན།
en: Any of you who do not wish to go forth in line with the teachings of the Blessed One should turn back here and now.” Then the five hundred pupils all said, “Whatever we know is through your authority.

source: ཁྱེད་རྒྱ་ཆེན་པོའི་གནས་སུ་རབ་ཏུ་འབྱུང་ན། ཁྱེད་གང་ལས་རབ་ཏུ་བྱུང་བ་དེ་ལས་བདག་ཅག་ཀྱང་རབ་ཏུ་འབྱུང་ངོ་།
en: If the two of you are embracing the wandering mendicant’s life on account of someone great, we too shall become wandering mendicants on account of the same person.”
